flyghost/OneOS-V2.1.0/drivers/hal/fm/FM33G0xx_HAL/FM33G0xx_HAL_Driver/Src/fm33g0xx_etim.c
/**
  ******************************************************************************
  * @file    fm33g0xx_etim.c
  * @author  FM33g0xx Application Team
  * @version V0.3.00G
  * @date    08-31-2018
  * @brief   This file provides firmware functions to manage the following 
  *          functionalities of....:
  *
*/

/* Includes ------------------------------------------------------------------*/
#include "fm33g0xx_etim.h"  


/** @addtogroup fm33g0xx_StdPeriph_Driver
  * @{
  */

/** @defgroup ETIM 
  * @brief ETIM driver modules
  * @{
  */ 

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/



/*********************************
externded timer高位计数器控制函数 
功能：ET计数器外部输入引脚数字滤波功能配置
输入: ETIM1/ETIM2/ETIM3/ETIM4  定时器名称
			ENABLE/DISABLE 		打开引脚输入信号数字滤波/关闭引脚输入信号数字滤波
输出: 无
*********************************/
void ETIMx_ETxCR_EXFLT_Setable(ETIMx_Type* ETIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		ETIMx->ETxCR |= (ETIMx_ETxCR_EXFLT_Msk);
	}
	else
	{
		ETIMx->ETxCR &= ~(ETIMx_ETxCR_EXFLT_Msk);
	}
}
/*********************************
externded timer高位计数器控制函数 
功能：获取ET计数器外部输入引脚数字滤波功能配置
输入: ETIM1/ETIM2/ETIM3/ETIM4  定时器名称
输出: ENABLE/DISABLE 		打开引脚输入信号数字滤波/关闭引脚输入信号数字滤波
*********************************/
FunState ETIMx_ETxCR_EXFLT_Getable(ETIMx_Type* ETIMx)
{
	if (ETIMx->ETxCR & (ETIMx_ETxCR_EXFLT_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/*********************************
externded timer高位计数器控制函数 
功能：ET计数器PWM输出使能配置
输入: ETIM1/ETIM2/ETIM3/ETIM4  定时器名称
			ENABLE/DISABLE 		PWM输出使能/PWM输出禁止
输出: 无
*********************************/
void ETIMx_ETxCR_PWM_Setable(ETIMx_Type* ETIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		ETIMx->ETxCR |= (ETIMx_ETxCR_PWM_Msk);
	}
	else
	{
		ETIMx->ETxCR &= ~(ETIMx_ETxCR_PWM_Msk);
	}
}
/*********************************
externded timer高位计数器控制函数 
功能：获取ET计数器PWM输出使能配置
输入: ETIM1/ETIM2/ETIM3/ETIM4  定时器名称
输出: ENABLE/DISABLE 		PWM输出使能/PWM输出禁止
*********************************/
FunState ETIMx_ETxCR_PWM_Getable(ETIMx_Type* ETIMx)
{
	if (ETIMx->ETxCR & (ETIMx_ETxCR_PWM_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}
/*********************************
externded timer高位计数器控制函数 
功能：ET计数器启动配置
输入: ETIM1/ETIM2/ETIM3/ETIM4  定时器名称
			ENABLE/DISABLE 		 启动定时器/停止定时器
输出: 无
*********************************/
void ETIMx_ETxCR_CEN_Setable(ETIMx_Type* ETIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		ETIMx->ETxCR |= (ETIMx_ETxCR_CEN_Msk);
	}
	else
	{
		ETIMx->ETxCR &= ~(ETIMx_ETxCR_CEN_Msk);
	}
}

/*********************************
externded timer高位计数器控制函数 
功能：获取ET计数器启动配置
输入: ETIM1/ETIM2/ETIM3/ETIM4  定时器名称
输出: ENABLE/DISABLE 		 启动定时器/停止定时器
*********************************/
FunState ETIMx_ETxCR_CEN_Getable(ETIMx_Type* ETIMx)
{
	if (ETIMx->ETxCR & (ETIMx_ETxCR_CEN_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/*********************************
externded timer高位计数器控制函数 
功能：配置ET计数器工作模式
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
			ETIMx_ETxCR_MOD_COUNTER		0 = 计数模式
			/ETIMx_ETxCR_MOD_CAPTURE	1 = 捕捉模式
输出: 无
*********************************/
void ETIMx_ETxCR_MOD_Set(ETIMx_Type* ETIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ETIMx->ETxCR;
	tmpreg &= ~(ETIMx_ETxCR_MOD_Msk);
	tmpreg |= (SetValue & ETIMx_ETxCR_MOD_Msk);
	ETIMx->ETxCR = tmpreg;
}
/*********************************
externded timer高位计数器控制函数 
功能：获取ET计数器工作模式
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
输出: ETIMx_ETxCR_MOD_COUNTER		0 = 计数模式
			/ETIMx_ETxCR_MOD_CAPTURE	1 = 捕捉模式
*********************************/
uint32_t ETIMx_ETxCR_MOD_Get(ETIMx_Type* ETIMx)
{
	return (ETIMx->ETxCR & ETIMx_ETxCR_MOD_Msk);
}

/*********************************
externded timer高位计数器控制函数 
功能：配置ET计数器级联功能
输入: ETIM1/ETIM2/ETIM3/ETIM4  定时器名称
			ENABLE/DISABLE 		 ET1（ET3）和ET2（ET4）级联成32bit定时器/16bit定时器独立工作
输出: 无
*********************************/
void ETIMx_ETxCR_CASEN_Setable(ETIMx_Type* ETIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		ETIMx->ETxCR |= (ETIMx_ETxCR_CASEN_Msk);
	}
	else
	{
		ETIMx->ETxCR &= ~(ETIMx_ETxCR_CASEN_Msk);
	}
}
/*********************************
externded timer高位计数器控制函数 
功能：获取ET计数器级联功能配置
输入: ETIM1/ETIM2/ETIM3/ETIM4  定时器名称
输出: ENABLE/DISABLE 		 ET1（ET3）和ET2（ET4）级联成32bit定时器/16bit定时器独立工作
*********************************/
FunState ETIMx_ETxCR_CASEN_Getable(ETIMx_Type* ETIMx)
{
	if (ETIMx->ETxCR & (ETIMx_ETxCR_CASEN_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/*********************************
externded timer高位计数器控制函数 
功能：配置ET计数器计数模式采沿方式(计数时钟选择mcu_clk时该位无效，总是采用mcu_clk时钟上升沿计数)
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
			ETIMx_ETxCR_EDGESEL_RISING		0 = 计数模式采上升沿
			/ETIMx_ETxCR_EDGESEL_FALLING	1 = 计数模式采下降沿
输出: 无
*********************************/
void ETIMx_ETxCR_EDGESEL_Set(ETIMx_Type* ETIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ETIMx->ETxCR;
	tmpreg &= ~(ETIMx_ETxCR_EDGESEL_Msk);
	tmpreg |= (SetValue & ETIMx_ETxCR_EDGESEL_Msk);
	ETIMx->ETxCR = tmpreg;
}
/*********************************
externded timer高位计数器控制函数 
功能：获取ET计数器计数模式采沿方式(计数时钟选择mcu_clk时该位无效，总是采用mcu_clk时钟上升沿计数)
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
输出: ETIMx_ETxCR_EDGESEL_RISING		0 = 计数模式采上升沿
			/ETIMx_ETxCR_EDGESEL_FALLING	1 = 计数模式采下降沿
*********************************/
uint32_t ETIMx_ETxCR_EDGESEL_Get(ETIMx_Type* ETIMx)
{
	return (ETIMx->ETxCR & ETIMx_ETxCR_EDGESEL_Msk);
}

/*********************************
externded timer高位计数器控制函数 
功能：配置ET计数器捕捉模式
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
			ETIMx_ETxCR_CAPMOD_PERIOD		0 = 脉冲周期捕捉
			/ETIMx_ETxCR_CAPMOD_PULSE		1 = 脉宽捕捉
输出: 无
*********************************/
void ETIMx_ETxCR_CAPMOD_Set(ETIMx_Type* ETIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ETIMx->ETxCR;
	tmpreg &= ~(ETIMx_ETxCR_CAPMOD_Msk);
	tmpreg |= (SetValue & ETIMx_ETxCR_CAPMOD_Msk);
	ETIMx->ETxCR = tmpreg;
}
/*********************************
externded timer高位计数器控制函数 
功能：获取ET计数器捕捉模式
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
输出: ETIMx_ETxCR_CAPMOD_PERIOD		0 = 脉冲周期捕捉
			/ETIMx_ETxCR_CAPMOD_PULSE		1 = 脉宽捕捉
*********************************/
uint32_t ETIMx_ETxCR_CAPMOD_Get(ETIMx_Type* ETIMx)
{
	return (ETIMx->ETxCR & ETIMx_ETxCR_CAPMOD_Msk);
}

