flyghost/OneOS-V2.1.0/drivers/hal/fm/FM33G0xx_HAL/FM33G0xx_HAL_Driver/Src/fm33g0xx_etim.c
/*********************************
externded timer高位计数器控制函数 
功能：配置ET计数器带清零捕捉模式
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
			ENABLE/DISABLE		事件触发捕捉：使能后计数器保持0，捕捉到第一个有效沿之后timer才开始计数/ 捕捉不清零，计数器一直自由计数
输出: 无
*********************************/
void ETIMx_ETxCR_CAPCLR_Setable(ETIMx_Type* ETIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		ETIMx->ETxCR |= (ETIMx_ETxCR_CAPCLR_Msk);
	}
	else
	{
		ETIMx->ETxCR &= ~(ETIMx_ETxCR_CAPCLR_Msk);
	}
}
/*********************************
externded timer高位计数器控制函数 
功能：获取置ET计数器带清零捕捉模式配置
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
输出: ENABLE/DISABLE		事件触发捕捉：使能后计数器保持0，捕捉到第一个有效沿之后timer才开始计数/ 捕捉不清零，计数器一直自由计数
*********************************/
FunState ETIMx_ETxCR_CAPCLR_Getable(ETIMx_Type* ETIMx)
{
	if (ETIMx->ETxCR & (ETIMx_ETxCR_CAPCLR_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/*********************************
externded timer高位计数器控制函数 
功能：配置ET计数器单次捕捉有效
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
			ENABLE/DISABLE		单次捕捉有效/连续捕捉
输出: 无
*********************************/
void ETIMx_ETxCR_CAPONCE_Setable(ETIMx_Type* ETIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		ETIMx->ETxCR |= (ETIMx_ETxCR_CAPONCE_Msk);
	}
	else
	{
		ETIMx->ETxCR &= ~(ETIMx_ETxCR_CAPONCE_Msk);
	}
}
/*********************************
externded timer高位计数器控制函数 
功能：获取ET计数器单次捕捉有效配置
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
输出: ENABLE/DISABLE		单次捕捉有效/连续捕捉
*********************************/
FunState ETIMx_ETxCR_CAPONCE_Getable(ETIMx_Type* ETIMx)
{
	if (ETIMx->ETxCR & (ETIMx_ETxCR_CAPONCE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/*********************************
externded timer高位计数器控制函数 
功能：配置ET计数器捕捉沿选择
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
			ETIMx_ETxCR_CAPEDGE_RISING		0 = 周期捕捉模式时上沿捕捉
			ETIMx_ETxCR_CAPEDGE_FALLING		1 = 周期捕捉模式时下沿捕捉
输出: 无
*********************************/
void ETIMx_ETxCR_CAPEDGE_Set(ETIMx_Type* ETIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ETIMx->ETxCR;
	tmpreg &= ~(ETIMx_ETxCR_CAPEDGE_Msk);
	tmpreg |= (SetValue & ETIMx_ETxCR_CAPEDGE_Msk);
	ETIMx->ETxCR = tmpreg;
}

/*********************************
externded timer高位计数器控制函数 
功能：获取ET计数器捕捉沿选择配置
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
输出: ETIMx_ETxCR_CAPEDGE_RISING		0 = 周期捕捉模式时上沿捕捉
			ETIMx_ETxCR_CAPEDGE_FALLING		1 = 周期捕捉模式时下沿捕捉
*********************************/
uint32_t ETIMx_ETxCR_CAPEDGE_Get(ETIMx_Type* ETIMx)
{
	return (ETIMx->ETxCR & ETIMx_ETxCR_CAPEDGE_Msk);
}

/*********************************
externded timer高位计数器控制函数 
功能：配置ET内部信号2源选择(捕捉源)
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
			ETIMx_ETxINSEL_SIG2SEL_GROUP2		0 = 扩展定时器3的内部信号2选择Group2
			/ETIMx_ETxINSEL_SIG2SEL_GROUP1	1 = 扩展定时器3的内部信号2选择Group1
输出: 无
*********************************/
void ETIMx_ETxINSEL_SIG2SEL_Set(ETIMx_Type* ETIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ETIMx->ETxINSEL;
	tmpreg &= ~(ETIMx_ETxINSEL_SIG2SEL_Msk);
	tmpreg |= (SetValue & ETIMx_ETxINSEL_SIG2SEL_Msk);
	ETIMx->ETxINSEL = tmpreg;
}
/*********************************
externded timer高位计数器控制函数 
功能：获取ET内部信号2源选择(捕捉源)
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
输出: ETIMx_ETxINSEL_SIG2SEL_GROUP2		0 = 扩展定时器的内部信号2选择Group2
			/ETIMx_ETxINSEL_SIG2SEL_GROUP1	1 = 扩展定时器的内部信号2选择Group1
*********************************/
uint32_t ETIMx_ETxINSEL_SIG2SEL_Get(ETIMx_Type* ETIMx)
{
	return (ETIMx->ETxINSEL & ETIMx_ETxINSEL_SIG2SEL_Msk);
}

/*********************************
externded timer高位计数器控制函数 
功能：配置ET内部信号1源选择（在计数模式下计数源仅由此选择，捕捉模式下计数源）
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
			ETIMx_ETxINSEL_SIG1SEL_GROUP1			0 = 扩展定时器的内部信号1选择Group1
			/ETIMx_ETxINSEL_SIG1SEL_GROUP2		1 = 扩展定时器的内部信号1选择Group2 
输出: 无
*********************************/
void ETIMx_ETxINSEL_SIG1SEL_Set(ETIMx_Type* ETIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ETIMx->ETxINSEL;
	tmpreg &= ~(ETIMx_ETxINSEL_SIG1SEL_Msk);
	tmpreg |= (SetValue & ETIMx_ETxINSEL_SIG1SEL_Msk);
	ETIMx->ETxINSEL = tmpreg;
}
/*********************************
externded timer高位计数器控制函数 
功能：获取ET内部信号1源选择（在计数模式下计数源仅由此选择，捕捉模式下计数源）
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
输出: ETIMx_ETxINSEL_SIG1SEL_GROUP1			0 = 扩展定时器的内部信号1选择Group1
			/ETIMx_ETxINSEL_SIG1SEL_GROUP2		1 = 扩展定时器的内部信号1选择Group2 
*********************************/
uint32_t ETIMx_ETxINSEL_SIG1SEL_Get(ETIMx_Type* ETIMx)
{
	return (ETIMx->ETxINSEL & ETIMx_ETxINSEL_SIG1SEL_Msk);
}

/*********************************
externded timer高位计数器控制函数 
功能：配置ET GROUP2 信号选择
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
			ETIMx_ETxINSEL_GRP2SEL_ET1_UART0_RX				ET1 000 = UART0_RX
			/ETIMx_ETxINSEL_GRP2SEL_ET1_UART1_RX			ET1 001 = UART1_RX
			/ETIMx_ETxINSEL_GRP2SEL_ET1_XTLF					ET1 010 = XTLF
			/ETIMx_ETxINSEL_GRP2SEL_ET1_ET1_IN1				ET1 011 = ET1_IN1
			/ETIMx_ETxINSEL_GRP2SEL_ET1_ET1_IN2				ET1 100 = ET1_IN2
			/ETIMx_ETxINSEL_GRP2SEL_ET1_CMP1O					ET1 101 = CMP1O（比较器1输出）
			/ETIMx_ETxINSEL_GRP2SEL_ET1_CMP2O					ET1 110 = CMP2O（比较器2输出
			/ETIMx_ETxINSEL_GRP2SEL_ET1_LPTO					ET1 111 = LPTO
			/ETIMx_ETxINSEL_GRP2SEL_ET2_UART2_RX			ET2 000 = UART2_RX
			/ETIMx_ETxINSEL_GRP2SEL_ET2_UART3_RX			ET2 001 = UART3_RX
			/ETIMx_ETxINSEL_GRP2SEL_ET2_XTLF					ET2 010 = XTLF
			/ETIMx_ETxINSEL_GRP2SEL_ET2_ET2_IN1				ET2 011 = ET2_IN1
			/ETIMx_ETxINSEL_GRP2SEL_ET2_ET2_IN2				ET2 100 = ET2_IN2
			/ETIMx_ETxINSEL_GRP2SEL_ET2_CMP1O					ET2 101 = CMP1O（比较器1输出）
			/ETIMx_ETxINSEL_GRP2SEL_ET2_CMP2O					ET2 110 = CMP2O（比较器2输出）
			/ETIMx_ETxINSEL_GRP2SEL_ET2_LPTO					ET2 111 = LPTO
			/ETIMx_ETxINSEL_GRP2SEL_ET3_ET3_IN12			ET3 000 = ET3_IN1
			/ETIMx_ETxINSEL_GRP2SEL_ET3_XTLF					ET3 001 = XTLF
			/ETIMx_ETxINSEL_GRP2SEL_ET3_UART4_RX			ET3 010 = UART4_RX
			/ETIMx_ETxINSEL_GRP2SEL_ET3_UART5_RX			ET3 011 = UART5_RX
			/ETIMx_ETxINSEL_GRP2SEL_ET3_RTCSEC				ET3 100 = RTCSEC
			/ETIMx_ETxINSEL_GRP2SEL_ET4_ET4_IN1				ET4 000 = ET4_IN1
			/ETIMx_ETxINSEL_GRP2SEL_ET4_XTLF					ET4 001 = XTLF
			/ETIMx_ETxINSEL_GRP2SEL_ET4_UART_RX22			ET4 010 = UART_RX2
			/ETIMx_ETxINSEL_GRP2SEL_ET4_UART_RX0			ET4 011 = UART_RX0
			/ETIMx_ETxINSEL_GRP2SEL_ET4_CMP1O					ET4 100 = CMP1O（比较器1输出）
			/ETIMx_ETxINSEL_GRP2SEL_ET4_CMP2O					ET4 101 = CMP2O（比较器2输出）
			/ETIMx_ETxINSEL_GRP2SEL_ET4_RTCSEC				ET4 110= RTCSEC
			/ETIMx_ETxINSEL_GRP2SEL_ET4_LPTO					ET4 111= LPTO
输出: 无
*********************************/
void ETIMx_ETxINSEL_GRP2SEL_Set(ETIMx_Type* ETIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ETIMx->ETxINSEL;
	tmpreg &= ~(ETIMx_ETxINSEL_GRP2SEL_Msk);
	tmpreg |= (SetValue & ETIMx_ETxINSEL_GRP2SEL_Msk);
	ETIMx->ETxINSEL = tmpreg;
}
/*********************************
externded timer高位计数器控制函数 
功能：获取ET GROUP2 信号选择
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
输出: /ETIMx_ETxINSEL_GRP2SEL_ET1_UART0_RX				ET1 000 = UART0_RX
			/ETIMx_ETxINSEL_GRP2SEL_ET1_UART1_RX			ET1 001 = UART1_RX
			/ETIMx_ETxINSEL_GRP2SEL_ET1_XTLF					ET1 010 = XTLF
			/ETIMx_ETxINSEL_GRP2SEL_ET1_ET1_IN1				ET1 011 = ET1_IN1
			/ETIMx_ETxINSEL_GRP2SEL_ET1_ET1_IN2				ET1 100 = ET1_IN2
			/ETIMx_ETxINSEL_GRP2SEL_ET1_CMP1O					ET1 101 = CMP1O（比较器1输出）
			/ETIMx_ETxINSEL_GRP2SEL_ET1_CMP2O					ET1 110 = CMP2O（比较器2输出
			/ETIMx_ETxINSEL_GRP2SEL_ET1_LPTO					ET1 111 = LPTO
			/ETIMx_ETxINSEL_GRP2SEL_ET2_UART2_RX			ET2 000 = UART2_RX
			/ETIMx_ETxINSEL_GRP2SEL_ET2_UART3_RX			ET2 001 = UART3_RX
			/ETIMx_ETxINSEL_GRP2SEL_ET2_XTLF					ET2 010 = XTLF
			/ETIMx_ETxINSEL_GRP2SEL_ET2_ET2_IN1				ET2 011 = ET2_IN1
			/ETIMx_ETxINSEL_GRP2SEL_ET2_ET2_IN2				ET2 100 = ET2_IN2
			/ETIMx_ETxINSEL_GRP2SEL_ET2_CMP1O					ET2 101 = CMP1O（比较器1输出）
			/ETIMx_ETxINSEL_GRP2SEL_ET2_CMP2O					ET2 110 = CMP2O（比较器2输出）
			/ETIMx_ETxINSEL_GRP2SEL_ET2_LPTO					ET2 111 = LPTO
			/ETIMx_ETxINSEL_GRP2SEL_ET3_ET3_IN12			ET3 000 = ET3_IN1
			/ETIMx_ETxINSEL_GRP2SEL_ET3_XTLF					ET3 001 = XTLF
			/ETIMx_ETxINSEL_GRP2SEL_ET3_UART4_RX			ET3 010 = UART4_RX
			/ETIMx_ETxINSEL_GRP2SEL_ET3_UART5_RX			ET3 011 = UART5_RX
			/ETIMx_ETxINSEL_GRP2SEL_ET3_RTCSEC				ET3 100 = RTCSEC
			/ETIMx_ETxINSEL_GRP2SEL_ET4_ET4_IN1				ET4 000 = ET4_IN1
			/ETIMx_ETxINSEL_GRP2SEL_ET4_XTLF					ET4 001 = XTLF
			/ETIMx_ETxINSEL_GRP2SEL_ET4_UART_RX22			ET4 010 = UART_RX2
			/ETIMx_ETxINSEL_GRP2SEL_ET4_UART_RX0			ET4 011 = UART_RX0
			/ETIMx_ETxINSEL_GRP2SEL_ET4_CMP1O					ET4 100 = CMP1O（比较器1输出）
			/ETIMx_ETxINSEL_GRP2SEL_ET4_CMP2O					ET4 101 = CMP2O（比较器2输出）
			/ETIMx_ETxINSEL_GRP2SEL_ET4_RTCSEC				ET4 110= RTCSEC
			/ETIMx_ETxINSEL_GRP2SEL_ET4_LPTO					ET4 111= LPTO
*********************************/
uint32_t ETIMx_ETxINSEL_GRP2SEL_Get(ETIMx_Type* ETIMx)
{
	return (ETIMx->ETxINSEL & ETIMx_ETxINSEL_GRP2SEL_Msk);
}

