flyghost/OneOS-V2.1.0/drivers/hal/fm/FM33G0xx_HAL/FM33G0xx_HAL_Driver/Src/fm33g0xx_etim.c
/*********************************
externded timer高位计数器控制函数 
功能：配置ET GROUP1 信号选择
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
			ETIMx_ETxINSEL_GRP1SEL_ET1_APBCLK			ET1 00 = APBCLK
			/ETIMx_ETxINSEL_GRP1SEL_ET1_XTLF			ET1 01 = XTLF
			/ETIMx_ETxINSEL_GRP1SEL_ET1_RCLP			ET1 10 = RCLP
			/ETIMx_ETxINSEL_GRP1SEL_ET1_ET1_IN0		ET1 11 = ET1_IN0
			/ETIMx_ETxINSEL_GRP1SEL_ET2_APBCLK		ET2 00 = APBCLK
			/ETIMx_ETxINSEL_GRP1SEL_ET2_XTLF			ET2 01 = XTLF
			/ETIMx_ETxINSEL_GRP1SEL_ET2_RCLP			ET2 10 = RCLP
			/ETIMx_ETxINSEL_GRP1SEL_ET2_ET2_IN0		ET2 11 = ET2_IN0
			/ETIMx_ETxINSEL_GRP1SEL_ET3_APBCLK		ET3 00 = APBCLK
			/ETIMx_ETxINSEL_GRP1SEL_ET3_ET3_IN0		ET3 01 = ET3_IN0
			/ETIMx_ETxINSEL_GRP1SEL_ET3_RTCSEC		ET3 10 = RTCSEC
			/ETIMx_ETxINSEL_GRP1SEL_ET3_RCLP			ET3 11 = RCLP
			/ETIMx_ETxINSEL_GRP1SEL_ET4_APBCLK		ET4 00 = APBCLK
			/ETIMx_ETxINSEL_GRP1SEL_ET4_ET4_IN0		ET4 01 = ET4_IN0
			/ETIMx_ETxINSEL_GRP1SEL_ET4_RTC64HZ		ET4 10 = RTC64HZ/
			/ETIMx_ETxINSEL_GRP1SEL_ET4_LPTO			ET4 11 = LPTO
输出: 无
*********************************/
void ETIMx_ETxINSEL_GRP1SEL_Set(ETIMx_Type* ETIMx, uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ETIMx->ETxINSEL;
	tmpreg &= ~(ETIMx_ETxINSEL_GRP1SEL_Msk);
	tmpreg |= (SetValue & ETIMx_ETxINSEL_GRP1SEL_Msk);
	ETIMx->ETxINSEL = tmpreg;
}
/*********************************
externded timer高位计数器控制函数 
功能：获取ET GROUP1 信号选择
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
输出: ETIMx_ETxINSEL_GRP1SEL_ET1_APBCLK			ET1 00 = APBCLK
			/ETIMx_ETxINSEL_GRP1SEL_ET1_XTLF			ET1 01 = XTLF
			/ETIMx_ETxINSEL_GRP1SEL_ET1_RCLP			ET1 10 = RCLP
			/ETIMx_ETxINSEL_GRP1SEL_ET1_ET1_IN0		ET1 11 = ET1_IN0
			/ETIMx_ETxINSEL_GRP1SEL_ET2_APBCLK		ET2 00 = APBCLK
			/ETIMx_ETxINSEL_GRP1SEL_ET2_XTLF			ET2 01 = XTLF
			/ETIMx_ETxINSEL_GRP1SEL_ET2_RCLP			ET2 10 = RCLP
			/ETIMx_ETxINSEL_GRP1SEL_ET2_ET2_IN0		ET2 11 = ET2_IN0
			/ETIMx_ETxINSEL_GRP1SEL_ET3_APBCLK		ET3 00 = APBCLK
			/ETIMx_ETxINSEL_GRP1SEL_ET3_ET3_IN0		ET3 01 = ET3_IN0
			/ETIMx_ETxINSEL_GRP1SEL_ET3_RTCSEC		ET3 10 = RTCSEC
			/ETIMx_ETxINSEL_GRP1SEL_ET3_RCLP			ET3 11 = RCLP
			/ETIMx_ETxINSEL_GRP1SEL_ET4_APBCLK		ET4 00 = APBCLK
			/ETIMx_ETxINSEL_GRP1SEL_ET4_ET4_IN0		ET4 01 = ET4_IN0
			/ETIMx_ETxINSEL_GRP1SEL_ET4_RTC64HZ		ET4 10 = RTC64HZ/
			/ETIMx_ETxINSEL_GRP1SEL_ET4_LPTO			ET4 11 = LPTO
*********************************/
uint32_t ETIMx_ETxINSEL_GRP1SEL_Get(ETIMx_Type* ETIMx)
{
	return (ETIMx->ETxINSEL & ETIMx_ETxINSEL_GRP1SEL_Msk);
}

/*********************************
externded timer高位计数器控制函数 
功能：配置ET Signal1(计数源)的预分频
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
			SetValue: 00-FF(00表示1分频，FF表示256分频)
输出: 无
*********************************/
void ETIMx_ETxPESCALE1_Write(ETIMx_Type* ETIMx, uint32_t SetValue)
{
	ETIMx->ETxPESCALE1 = (SetValue & ETIMx_ETxPESCALE1_PRESCALE1_Msk);
}
/*********************************
externded timer高位计数器控制函数 
功能：获取ET Signal1(计数源) 的预分频
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
输出: 00-FF(00表示1分频，FF表示256分频)
*********************************/
uint32_t ETIMx_ETxPESCALE1_Read(ETIMx_Type* ETIMx)
{
	return (ETIMx->ETxPESCALE1 & ETIMx_ETxPESCALE1_PRESCALE1_Msk);
}

/*********************************
externded timer高位计数器控制函数 
功能：配置ET Signal2(捕捉源)的预分频
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
			SetValue: 00-FF(00表示1分频，FF表示256分频)
输出: 无
*********************************/
void ETIMx_ETxPESCALE2_Write(ETIMx_Type* ETIMx, uint32_t SetValue)
{
	ETIMx->ETxPESCALE2 = (SetValue & ETIMx_ETxPESCALE2_PRESCALE2_Msk);
}
/*********************************
externded timer高位计数器控制函数 
功能：获取ET Signal2(捕捉源)的预分频
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
输出: 00-FF(00表示1分频，FF表示256分频)
*********************************/
uint32_t ETIMx_ETxPESCALE2_Read(ETIMx_Type* ETIMx)
{
	return (ETIMx->ETxPESCALE2 & ETIMx_ETxPESCALE2_PRESCALE2_Msk);
}

/*********************************
externded timer高位计数器控制函数 
功能：配置ET 计数初值
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
			SetValue: 00-FFFF
输出: 无
*********************************/
void ETIMx_ETxIVR_Write(ETIMx_Type* ETIMx, uint32_t SetValue)
{
	ETIMx->ETxIVR = (SetValue & ETIMx_ETxIVR_INITVALUE_Msk);
}
/*********************************
externded timer高位计数器控制函数 
功能：获取ET 计数值
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
输出: 00-FFFF
*********************************/
uint32_t ETIMx_ETxIVR_Read(ETIMx_Type* ETIMx)
{
	return (ETIMx->ETxIVR & ETIMx_ETxIVR_INITVALUE_Msk);
}

/*********************************
externded timer高位计数器控制函数 
功能：配置ET 比较值(该值与计数值比较，若计数值>=该值，则产生计数匹配信号至输出控制模块，并产生相应中断)
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
			SetValue: 00-FFFF
输出: 无
*********************************/
void ETIMx_ETxCMP_Write(ETIMx_Type* ETIMx, uint32_t SetValue)
{
	ETIMx->ETxCMP = (SetValue & ETIMx_ETxCMP_CMP_Msk);
}
/*********************************
externded timer高位计数器控制函数 
功能：获取ET 比较值
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
输出: 00-FFFF
*********************************/
uint32_t ETIMx_ETxCMP_Read(ETIMx_Type* ETIMx)
{
	return (ETIMx->ETxCMP & ETIMx_ETxCMP_CMP_Msk);
}

/*********************************
externded timer高位计数器控制函数 
功能：配置ET 比较中断
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
			ENABLE/DISABLE		比较中断使能/比较中断禁止	
输出: 无
*********************************/
void ETIMx_ETxIE_CMPIE_Setable(ETIMx_Type* ETIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		ETIMx->ETxIE |= (ETIMx_ETxIE_CMPIE_Msk);
	}
	else
	{
		ETIMx->ETxIE &= ~(ETIMx_ETxIE_CMPIE_Msk);
	}
}
/*********************************
externded timer高位计数器控制函数 
功能：获取ET 比较中断配置
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
输出: ENABLE/DISABLE		比较中断使能/比较中断禁止	
*********************************/
FunState ETIMx_ETxIE_CMPIE_Getable(ETIMx_Type* ETIMx)
{
	if (ETIMx->ETxIE & (ETIMx_ETxIE_CMPIE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/*********************************
externded timer高位计数器控制函数 
功能：配置ET 捕捉中断
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
			ENABLE/DISABLE		捕捉中断使能/捕捉中断禁止	
输出: 无
*********************************/
void ETIMx_ETxIE_CAPIE_Setable(ETIMx_Type* ETIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		ETIMx->ETxIE |= (ETIMx_ETxIE_CAPIE_Msk);
	}
	else
	{
		ETIMx->ETxIE &= ~(ETIMx_ETxIE_CAPIE_Msk);
	}
}
/*********************************
externded timer高位计数器控制函数 
功能：获取ET 捕捉中断
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
输出: ENABLE/DISABLE		捕捉中断使能/捕捉中断禁止	
*********************************/
FunState ETIMx_ETxIE_CAPIE_Getable(ETIMx_Type* ETIMx)
{
	if (ETIMx->ETxIE & (ETIMx_ETxIE_CAPIE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

