flyghost/OneOS-V2.1.0/drivers/hal/fm/FM33G0xx_HAL/FM33G0xx_HAL_Driver/Src/fm33g0xx_etim.c
/*********************************
externded timer高位计数器控制函数 
功能：配置ET 溢出中断
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
			ENABLE/DISABLE		溢出中断使能/溢出中断禁止	
输出: 无
*********************************/
void ETIMx_ETxIE_OVIE_Setable(ETIMx_Type* ETIMx, FunState NewState)
{
	if (NewState == ENABLE)
	{
		ETIMx->ETxIE |= (ETIMx_ETxIE_OVIE_Msk);
	}
	else
	{
		ETIMx->ETxIE &= ~(ETIMx_ETxIE_OVIE_Msk);
	}
}
/*********************************
externded timer高位计数器控制函数 
功能：获取ET 溢出中断
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
输出: ENABLE/DISABLE		溢出中断使能/溢出中断禁止	
*********************************/
FunState ETIMx_ETxIE_OVIE_Getable(ETIMx_Type* ETIMx)
{
	if (ETIMx->ETxIE & (ETIMx_ETxIE_OVIE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/*********************************
externded timer高位计数器控制函数 
功能：清ET 比较中断标志
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
输出: 无
*********************************/
void ETIMx_ETxIF_CMPIF_Clr(ETIMx_Type* ETIMx)
{
	ETIMx->ETxIF = ETIMx_ETxIF_CMPIF_Msk;
}
/*********************************
externded timer高位计数器控制函数 
功能：获取ET 比较中断标志
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
输出: SET/RESET			已发生比较中断/未发生比较中断
*********************************/
FlagStatus ETIMx_ETxIF_CMPIF_Chk(ETIMx_Type* ETIMx)
{
	if (ETIMx->ETxIF & ETIMx_ETxIF_CMPIF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/*********************************
externded timer高位计数器控制函数 
功能：获取ET 捕捉沿状态
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
输出: SET/RESET			脉冲宽度捕捉模式时表示捕捉到下沿/脉冲宽度捕捉模式时表示捕捉到上沿
*********************************/
FlagStatus ETIMx_ETxIF_EDGESTA_Chk(ETIMx_Type* ETIMx)
{
	if (ETIMx->ETxIF & ETIMx_ETxIF_EDGESTA_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/*********************************
externded timer高位计数器控制函数 
功能：清ET 产生捕捉信号标志
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
输出: 无
*********************************/
void ETIMx_ETxIF_CAPIF_Clr(ETIMx_Type* ETIMx)
{
	ETIMx->ETxIF = ETIMx_ETxIF_CAPIF_Msk;
}
/*********************************
externded timer高位计数器控制函数 
功能：获取ET 产生捕捉信号标志
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
输出: SET/RESET			捕捉到指定的沿/未捕捉到指定的沿
*********************************/
FlagStatus ETIMx_ETxIF_CAPIF_Chk(ETIMx_Type* ETIMx)
{
	if (ETIMx->ETxIF & ETIMx_ETxIF_CAPIF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/*********************************
externded timer高位计数器控制函数 
功能：清ET 产生溢出信号标志
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
输出: 无
*********************************/
void ETIMx_ETxIF_OVIF_Clr(ETIMx_Type* ETIMx)
{
	ETIMx->ETxIF = ETIMx_ETxIF_OVIF_Msk;
}
/*********************************
externded timer高位计数器控制函数 
功能：获取ET 产生溢出信号标志
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
输出: SET/RESET			产生计数溢出/未产生溢出
*********************************/
FlagStatus ETIMx_ETxIF_OVIF_Chk(ETIMx_Type* ETIMx)
{
	if (ETIMx->ETxIF & ETIMx_ETxIF_OVIF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/*********************************
获取ET 计数器数值函数
功能：获取ET 计数器数值
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
输出: 00-FFFF
      其余为无效值
*********************************/
uint32_t ETIMx_ETxCNT_Read(ETIMx_Type* ETIMx)
{
	volatile uint8_t tmp08;
  uint32_t tmp32;
  tmp08 = ((uint32_t)ETIMx - ETIMER1_BASE)>>5;	//获取ETIM
  switch(tmp08)
  {
    case 0:
      tmp32 = (ETCNT->ET1CNT & ETIMx_ETxCNT_ETxCNT_Msk);
      break;
    case 1:
      tmp32 = (ETCNT->ET2CNT & ETIMx_ETxCNT_ETxCNT_Msk);
      break;
    case 2:
      tmp32 = (ETCNT->ET3CNT & ETIMx_ETxCNT_ETxCNT_Msk);
      break;
    case 3:
      tmp32 = (ETCNT->ET4CNT & ETIMx_ETxCNT_ETxCNT_Msk);
      break;
    default:
      tmp32 = 0x1fffffff;
			break;
  }
  return tmp32;
}

/*********************************
externded timer高位计数器控制函数 
功能：ET初始化为缺省配置
输入: ETIM1/ETIM2/ETIM3/ETIM4  	定时器名称
输出: 无
*********************************/
void ETIMx_Deinit(ETIMx_Type* ETIMx)
{
	ETIMx->ETxCR = 0x00000000;
	ETIMx->ETxINSEL = 0x00000000;
	ETIMx->ETxPESCALE1 = 0x00000000;
	ETIMx->ETxPESCALE2 = 0x00000000;
	ETIMx->ETxIVR = 0x00000000;
	ETIMx->ETxCMP = 0x00000000;
	ETIMx->ETxIE = 0x00000000;
	//ETIMx->ETxIF = 0x00000000;
}
//Code_End


/*ETIMx 初始化配置函数*/
void ETIMx_Init(ETIMx_Type* ETIMx, ETIM_InitTypeDef* para)
{
	//信号源参数
	ETIMx_ETxINSEL_SIG1SEL_Set(ETIMx, para->sig_src_para.SIG1SEL);		/* 内部信号1源选择（在计数模式下计数源仅由此选择，捕捉模式下计数源） */
	ETIMx_ETxINSEL_SIG2SEL_Set(ETIMx, para->sig_src_para.SIG2SEL);		/* 内部信号2源选择(捕捉源) */
	ETIMx_ETxINSEL_GRP1SEL_Set(ETIMx, para->sig_src_para.GRP1SEL);		/* GROUP1 信号选择控制 */
	ETIMx_ETxINSEL_GRP2SEL_Set(ETIMx, para->sig_src_para.GRP2SEL);		/* GROUP2 信号选择控制 */
	ETIMx_ETxPESCALE1_Write(ETIMx, para->sig_src_para.PRESCALE1);		/* ETx预分频寄存器1 */
	ETIMx_ETxPESCALE2_Write(ETIMx, para->sig_src_para.PRESCALE2);		/* ETx预分频寄存器2 */
	
	//控制类参数
	ETIMx_ETxCR_EXFLT_Setable(ETIMx, para->ctrl_para.EXFLT);		/* 引脚输入数字滤波使能 */
	ETIMx_ETxCR_MOD_Set(ETIMx, para->ctrl_para.MOD);				/* 工作模式选择 */
	ETIMx_ETxCR_CASEN_Setable(ETIMx, para->ctrl_para.CASEN);		/* 扩展定时器级联使能 */
	ETIMx_ETxCR_EDGESEL_Set(ETIMx, para->ctrl_para.EDGESEL);		/* 计数模式采沿方式选择（计数时钟选择mcu_clk时该位无效，总是采用mcu_clk时钟上升沿计数） */

	ETIMx_ETxCR_PWM_Setable(ETIMx, para->ctrl_para.PWM);		/* PWM输出控制 */

	ETIMx_ETxCR_CAPMOD_Set(ETIMx, para->ctrl_para.CAPMOD);			/* 捕捉模式控制 */
	ETIMx_ETxCR_CAPCLR_Setable(ETIMx, para->ctrl_para.CAPCLR);		/* 带清零捕捉模式控制 */
	ETIMx_ETxCR_CAPONCE_Setable(ETIMx, para->ctrl_para.CAPONCE);	/* 单次捕捉控制 */
	ETIMx_ETxCR_CAPEDGE_Set(ETIMx, para->ctrl_para.CAPEDGE);		/* 捕捉沿选择 */

	ETIMx_ETxIVR_Write(ETIMx, para->ctrl_para.INITVALUE);	/* ETx初值寄存器 */
	ETIMx_ETxCMP_Write(ETIMx, para->ctrl_para.CMP);			/* ETx比较寄存器 */

	ETIMx_ETxIE_CMPIE_Setable(ETIMx, para->ctrl_para.CMPIE);		/* 扩展定时器比较中断使能 */
	ETIMx_ETxIE_CAPIE_Setable(ETIMx, para->ctrl_para.CAPIE);		/* 扩展定时器捕捉中断使能 */
	ETIMx_ETxIE_OVIE_Setable(ETIMx, para->ctrl_para.OVIE);			/* 扩展定时器溢出中断使能 */

	ETIMx_ETxCR_CEN_Setable(ETIMx, para->ctrl_para.CEN);		/* 启动控制 */
}


/******END OF FILE****/

